InformationRegisters/ОчередьВыгрузкиPDM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьВыгрузкиPDM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбменаPDM</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗавершенОбмен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омОчередьПДМНаСервере/Ext/Module.bsl
Функция ПоставитьОбъектВОчередь(ОбъектВыгрузки, ТипОбмена = Неопределено) Экспорт

	Возврат РегистрыСведений.ОчередьВыгрузкиPDM.ДобавитьОбъектВОчередь(ОбъектВыгрузки, ТипОбмена); 		

КонецФункции // ПоставитьОбъектВОчередь()


Функция ПолучитьДанныеИзОчереди() Экспорт

	ДанныеОперации 	= Новый Структура("ОписаниеОшибки, ОбъектВыгрузки", "");
	ПустаяДата		= Дата(1, 1, 1);
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ОчередьВыгрузкиPDM");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ЗавершенОбмен", 	ПустаяДата);
		ЭлементБлокировки.УстановитьЗначение("НачалоОбмена", 	ПустаяДата);
		БлокировкаДанных.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьВыгрузкиPDM.ОбъектВыгрузки КАК ОбъектВыгрузки,
		|	ОчередьВыгрузкиPDM.ТипОбмена КАК ТипОбмена
		|ИЗ
		|	РегистрСведений.ОчередьВыгрузкиPDM КАК ОчередьВыгрузкиPDM
		|ГДЕ
		|	ОчередьВыгрузкиPDM.НачалоОбмена = ДАТАВРЕМЯ(1, 1, 1)
		|	И ОчередьВыгрузкиPDM.ЗавершенОбмен = ДАТАВРЕМЯ(1, 1, 1)";
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
		КонецЦикла;
		
		
	Исключение
		
	    ДанныеОперации.Результат 		= Ложь;
		ДанныеОперации.ОписаниеОшибки 	= ОписаниеОшибки();

	КонецПопытки;

КонецФункции // ПолучитьДанныеИзОчереди()

Процедура ОтметкаОВыполнении()

	

КонецПроцедуры
